Revit 2027 API
SpecTypeId.LinearForce Property
 Linear Force, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LinearForce { get; }
Public Shared ReadOnly Property LinearForce As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LinearForce {
	ForgeTypeId^ get ();
}
static member LinearForce : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace